In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.105729 -1.619310
1    a  two -0.908416  2.702192
2    b  one -0.335924 -0.887682
3    b  two -0.401883 -0.877496
4    a  one  0.621518  0.002247

In [2]:
df.set_index('key1',inplace=True)
df

     key2     data1     data2
key1
a     one -0.105729 -1.619310
a     two -0.908416  2.702192
b     one -0.335924 -0.887682
b     two -0.401883 -0.877496
a     one  0.621518  0.002247

In [6]:
df.groupby(level='key1')[['data1', 'data2']].sum()

         data1     data2
key1
a    -0.392628  1.085129
b    -0.737806 -1.765178

In [8]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.587929  0.734202
1    a  two -1.717700 -0.564789
2    b  one  1.098633 -0.756355
3    b  two  0.368419 -1.208057
4    a  one  0.997322  1.808069

In [11]:
df['data1'].groupby(df['key1']).sum()

key1
a   -2.308308
b    1.467053
Name: data1, dtype: float64

In [12]:
df[['data1','data2']].groupby(df['key1']).sum()

         data1     data2
key1
a    -2.308308  1.977482
b     1.467053 -1.964412